{
  "entries": [
    {
      "date": "2019-07-10",
      "concepts": "Celebrity Tribute Group Project: Practice using Git, GitHub, and Flexbox",
      "entry": "Today we completed and presented our first group projects. My group did a celebrity tribute page for Rihanna. We had to practice pushing and merging on GitHub as well as CSS styling using Flexbox.",
      "mood": "OK",
      "id": 1
    },
    {
      "date": "2019-07-11",
      "concepts": "DOM Manipulation with JavaScript",
      "entry": "Today we covered Book 2, Chapter 1 \"Fun with Manipulating DOM.\" We practiced using document.querySelector() and document.querySelectorAll() to target HTML elements in order to add and/or remove classes from them.",
      "mood": "OK",
      "id": 2
    },
    {
      "date": "2019-07-12",
      "concepts": "JavaScript Objects",
      "entry": "Today we covered Book 2, Chapter 2 \"JavaScript Objects.\" We practiced accessing values within various combinations of objects and arrays.",
      "mood": "OK",
      "id": 3
    },
    {
      "date": "2019-07-15",
      "concepts": "JavaScript Functions",
      "entry": "Today we covered Book 2, Chapter 4 \"Functions & Logic.\" We practiced writing functions that involved iterations through arrays and objects",
      "mood": "OK",
      "id": 4
    },
    {
      "date": "2019-07-16",
      "concepts": "JavaScript Functions - Part 2",
      "entry": "Today we had lab time most of the day to work on exercises related to JavaScript functions. I practiced for...in loops and the forEach method.",
      "mood": "OK",
      "id": 5
    },
    {
      "date": "2019-07-17",
      "concepts": "Building the DOM using JavaScript",
      "entry": "We learned how to use JavaScript to build HTML instead of writing it manually into the index.html file. It involced a lot of functions and loops. My brain went blank towards the end of the day. I'll need more time to process what I learned.",
      "mood": "OK",
      "id": 6
    },
    {
      "date": "2019-07-18",
      "concepts": "Building and Using APIs",
      "entry": "We had lab time for the majority of the day. I continued to practice creating HTML representations of data in the DOM. Towards the end of the day we started learning about APIs, during which we created our first JSON file to store some properties of our favorite foods.",
      "mood": "OK",
      "id": 7
    },
    {
      "date": "2019-07-19",
      "concepts": "Building and Using APIs - Part 2",
      "entry": "We worked with our Foods JSON in Postman. We then added a barcode from 'Open Food Facts' to each of our food JSON objects and used that to fetch data about each food from their API. We created an HTML representation of the data in the DOM. I got it all to work with help from Jacquelyn!",
      "mood": "Happy",
      "id": 8
    },
    {
      "date": "2019-07-22",
      "concepts": "Group Dash Project with API",
      "entry": "Steve reviewed how to fetch data from an API using Javascript. We had short 'dash' group projects that required us to use a subset of data from https://jsonplaceholder.typicode.com and flexbox to build an HTML representation in the DOM with a certain number of items per colum.",
      "mood": "Happy",
      "id": 9
    },
    {
      "date": "2019-07-23",
      "concepts": "JavaScript Event Handlers",
      "entry": "Today we were introduced to event handlers in JavaScript. I completed 3 practice exercises, but I had trouble getting through them.",
      "mood": "Frustrated",
      "id": 10
    },
    {
      "date": "2019-07-24",
      "concepts": "Collecting User Input",
      "entry": "Today we covered Book 2, Chapter 13 \"Collecting User Input.\" I used event listeners on a submit button that collected the user input values and output them to the DOM.",
      "mood": "OK",
      "id": 11
    },
    {
      "date": "2019-07-25",
      "concepts": "Networking Talk & Welcome to Nashville - Day 1",
      "entry": "Dejan Stjepanovic (former NSS student who works at EY) and Daniel Weese (a Senior Developer who works at EY and recruits for them) came to speak to our class about the do's and don'ts of networking. They advised us to find a core group of topics we're interested in and attend those meetups rather than trying to go to a lot of different ones. Dan told us that \"LinkedIn is like a pet. You have to care for it, not just leave it in a corner.\" After the talk, Steve broke us up into groups to start our 2nd group project: Welcome to Nashville.",
      "mood": "Happy",
      "id": 12
    },
    {
      "date": "2019-07-26",
      "concepts": "Welcome to Nashville - Day 2",
      "entry": "We went straight to our groups. I spent most of the day just trying to fetch data from an API. I started on the Eventbrite API, but then I switched to Ticketmaster. By the end of the day, Jacquelyn and I were both able to fetch data from our APIs and console.log it.",
      "mood": "OK",
      "id": 13
    },
    {
      "date": "2019-07-29",
      "concepts": "Welcome to Nashville - Day 3",
      "entry": "Today our group sat down together and walked through the coding for the parks API. It helped me to see how data was fetched from another API because it was slightly different than mine. By the end of the day, we reached MVP, so we celebrated with high-fives and did some basic styling.",
      "mood": "Happy",
      "id": 14
    },
    {
      "date": "2019-07-30",
      "concepts": "Welcome to Nashville - Last Day",
      "entry": "My group started the day by merging Jacquelyn's formatting changes. After that we walked through the signal flow of our code for each separate API. On the whiteboard, we wrote down the steps the application had to take in order to generate the final product. We presented our project to Steve and Bryan and went through our sprint retrospective. Steve pointed out that instead of using .split to get to the street address in the Parks API, we could've parsed it to JSON. I plan to try it later.",
      "mood": "Happy",
      "id": 15
    },
    {
      "date": "2019-07-31",
      "concepts": "Factory Functions & LinkedIn",
      "entry": "I spent the first half of the day working on my LinkedIn profile. After lunch, we started Book 3, Chapter 1 \"Factory Functions,\" which was later changed to Chapter 3. We learned how to convert a returned object into a string.",
      "mood": "OK",
      "id": 16
    },
    {
      "date": "2019-08-01",
      "concepts": "Array Methods",
      "entry": "I spent most of the day working on my LinkedIn profile. After lunch, we started Book 3, Chapter 3 \"Filtering Data with Array Methods,\" which was later moved to Chapter 5. We learned that the .map method generates a new array with whatever you return from the function.",
      "mood": "Exhausted",
      "id": 17
    },
    {
      "date": "2019-08-02",
      "concepts": "Array Methods and Data Immutability",
      "entry": "Today we finished Book 3, Chapter 5 \"Array Methods.\" We talked about methods that mutate the array and methods that create a separate array before making changes. Steve said that once we get to React, raw data that we receive from a source should never be modified. It must remain immutable.",
      "mood": "OK",
      "id": 18
    },
    {
      "date": "2019-08-05",
      "concepts": "Modular Code using ES6 Modules",
      "entry": "Today Steve went over the new Book 3, Chapter 1: ES6 Modules. We learned that you should only link your main JavaScript file on the index.html and export and import data from the other JavaScript files. Steve said that for now, we should only return one thing from each file. If you want to return more than one thing, you have to return them within an object.",
      "mood": "Meh",
      "id": 19
    },
    {
      "date": "2019-08-06",
      "concepts": "Deleting Data from APIs",
      "entry": "In the morning Steve walked through Book 3, Chapter 7: Deleting Data. He showed us how to delete data in an API, and then we had the opportunity to ask him to go over any topic related to our work. I asked him to go over input validation in JavaScript, and he showed us how to check for empty fields. We had lab for the rest of the day, and I worked on my journal and then did exercises in the Array Methods chapter.",
      "mood": "OK",
      "id": 20
    },
    {
      "date": "2019-08-07",
      "concepts": "How to handle Asynchronous Fetch Calls",
      "entry": "Today the air conditioning was out in the building. Presumably, the chiller was hit by lightning in the severe storms last night. We had lab in the morning and then relocated to NTC's space in the old building. After lunch, Jenna and Bryan presented some projects they created involving bikes and helmets that were designed to illustrate the concept that if you're running fetch calls to more than one API, you have to write your code to allow for either one to return first. You can either force them to run one after the other using .then, or you can use conditional statements that allow for either one to return first.",
      "mood": "OK",
      "id": 21
    },
    {
      "date": "2019-08-08",
      "concepts": "Webpack (Briefly)",
      "entry": "Everyone worked from home until 1:30 pm. We went over setting up Webpack briefly, and then we went to NTC to do a \"soft demo day\" for Cohort 31 and Evening 8 students. I visited about 8 people and saw their front-end and back-end capstone projects. I took note of what makes a good presentation and what doesn't, so hopefully that will help me when I present my capstone.",
      "mood": "Happy",
      "id": 22
    },
    {
      "date": "2019-08-09",
      "concepts": "Webpack (Lab Day)",
      "entry": "The air conditioning is still out in our building, so our class split up and went to different locations. I went to Room 100 at United Way with Jacquelyn and Eric. I completed the first practice exercise under Book 3, Chapter 13 \"Webpack.\" I set up the file structure for the second practice exercise, but I'll finish that one later!",
      "mood": "Meh",
      "id": 23
    }
  ]
}